import { ProductType } from "../types"

export const Products: ProductType[] = [
    {
        product_id: 2,
        name: "iPhone 15 Pro Max",
        description: "iPhone 15 Pro Max เปลี่ยนวัสดุตัวเครื่องเป็นไทเทเนียมที่แข็งแกร่งและมีน้ำหนักเบาเกรดเดียวกับที่ใช้ในอุตสาหกรรมอวกาศ พร้อมกล้องระดับโปรที่อเนกประสงค์ยิ่งกว่าเดิม ถ่ายภาพระยะใกล้ได้คมชัดจากที่ที่ไกลกว่าเดิมด้วยกล้องเทเลโฟโต้ 5 เท่า ให้คุณได้ภาพจากระยะที่ชอบในมุมที่ใช่\nการเชื่อมต่อระดับโปร ด้วยช่องต่อ USB-C\nชิป A17 Pro GPU ระดับโปรให้เล่นเกมมือถือรู้สึกเต็มอิ่มสมจริงยิ่งขึ้น\nปุ่มแอ็คชั่นที่ปรับแต่งได้ตามต้องการทั้ง ปิดเสียง กล้อง บันทึกเสียง และอีกมากมาย",
        price: 48000,
        stock_quantity: 50,
        color: "#878681",
        memory: 256,
        c_name: "Smart Phone",
        image: "'https://dtaconline.dtac.co.th/pub/media/catalog/product/cache/e96373d1c57081d0b326a3dfa1f55e67/p/a/packshot-iphone-15-pro-max-black_20.png'",
        brand: "apple"
    },
    {
        product_id: 2,
        name: "iPhone 15 Pro Max",
        description: "iPhone 15 Pro Max เปลี่ยนวัสดุตัวเครื่องเป็นไทเทเนียมที่แข็งแกร่งและมีน้ำหนักเบาเกรดเดียวกับที่ใช้ในอุตสาหกรรมอวกาศ พร้อมกล้องระดับโปรที่อเนกประสงค์ยิ่งกว่าเดิม ถ่ายภาพระยะใกล้ได้คมชัดจากที่ที่ไกลกว่าเดิมด้วยกล้องเทเลโฟโต้ 5 เท่า ให้คุณได้ภาพจากระยะที่ชอบในมุมที่ใช่\nการเชื่อมต่อระดับโปร ด้วยช่องต่อ USB-C\nชิป A17 Pro GPU ระดับโปรให้เล่นเกมมือถือรู้สึกเต็มอิ่มสมจริงยิ่งขึ้น\nปุ่มแอ็คชั่นที่ปรับแต่งได้ตามต้องการทั้ง ปิดเสียง กล้อง บันทึกเสียง และอีกมากมาย",
        price: 48000,
        stock_quantity: 50,
        color: "#878681",
        memory: 256,
        c_name: "Smart Phone",
        image: "'https://dtaconline.dtac.co.th/pub/media/catalog/product/cache/e96373d1c57081d0b326a3dfa1f55e67/p/a/packshot-iphone-15-pro-max-black_20.png'",
        brand: "apple"
    },
    {
        product_id: 2,
        name: "iPhone 15 Pro Max",
        description: "iPhone 15 Pro Max เปลี่ยนวัสดุตัวเครื่องเป็นไทเทเนียมที่แข็งแกร่งและมีน้ำหนักเบาเกรดเดียวกับที่ใช้ในอุตสาหกรรมอวกาศ พร้อมกล้องระดับโปรที่อเนกประสงค์ยิ่งกว่าเดิม ถ่ายภาพระยะใกล้ได้คมชัดจากที่ที่ไกลกว่าเดิมด้วยกล้องเทเลโฟโต้ 5 เท่า ให้คุณได้ภาพจากระยะที่ชอบในมุมที่ใช่\nการเชื่อมต่อระดับโปร ด้วยช่องต่อ USB-C\nชิป A17 Pro GPU ระดับโปรให้เล่นเกมมือถือรู้สึกเต็มอิ่มสมจริงยิ่งขึ้น\nปุ่มแอ็คชั่นที่ปรับแต่งได้ตามต้องการทั้ง ปิดเสียง กล้อง บันทึกเสียง และอีกมากมาย",
        price: 48000,
        stock_quantity: 50,
        color: "#878681",
        memory: 256,
        c_name: "Smart Phone",
        image: "'https://dtaconline.dtac.co.th/pub/media/catalog/product/cache/e96373d1c57081d0b326a3dfa1f55e67/p/a/packshot-iphone-15-pro-max-black_20.png'",
        brand: "apple"
    },
    {
        product_id: 2,
        name: "iPhone 15 Pro Max",
        description: "iPhone 15 Pro Max เปลี่ยนวัสดุตัวเครื่องเป็นไทเทเนียมที่แข็งแกร่งและมีน้ำหนักเบาเกรดเดียวกับที่ใช้ในอุตสาหกรรมอวกาศ พร้อมกล้องระดับโปรที่อเนกประสงค์ยิ่งกว่าเดิม ถ่ายภาพระยะใกล้ได้คมชัดจากที่ที่ไกลกว่าเดิมด้วยกล้องเทเลโฟโต้ 5 เท่า ให้คุณได้ภาพจากระยะที่ชอบในมุมที่ใช่\nการเชื่อมต่อระดับโปร ด้วยช่องต่อ USB-C\nชิป A17 Pro GPU ระดับโปรให้เล่นเกมมือถือรู้สึกเต็มอิ่มสมจริงยิ่งขึ้น\nปุ่มแอ็คชั่นที่ปรับแต่งได้ตามต้องการทั้ง ปิดเสียง กล้อง บันทึกเสียง และอีกมากมาย",
        price: 48000,
        stock_quantity: 50,
        color: "#878681",
        memory: 256,
        c_name: "Smart Phone",
        image: "'https://dtaconline.dtac.co.th/pub/media/catalog/product/cache/e96373d1c57081d0b326a3dfa1f55e67/p/a/packshot-iphone-15-pro-max-black_20.png'",
        brand: "apple"
    },
    {
        product_id: 2,
        name: "iPhone 15 Pro Max",
        description: "iPhone 15 Pro Max เปลี่ยนวัสดุตัวเครื่องเป็นไทเทเนียมที่แข็งแกร่งและมีน้ำหนักเบาเกรดเดียวกับที่ใช้ในอุตสาหกรรมอวกาศ พร้อมกล้องระดับโปรที่อเนกประสงค์ยิ่งกว่าเดิม ถ่ายภาพระยะใกล้ได้คมชัดจากที่ที่ไกลกว่าเดิมด้วยกล้องเทเลโฟโต้ 5 เท่า ให้คุณได้ภาพจากระยะที่ชอบในมุมที่ใช่\nการเชื่อมต่อระดับโปร ด้วยช่องต่อ USB-C\nชิป A17 Pro GPU ระดับโปรให้เล่นเกมมือถือรู้สึกเต็มอิ่มสมจริงยิ่งขึ้น\nปุ่มแอ็คชั่นที่ปรับแต่งได้ตามต้องการทั้ง ปิดเสียง กล้อง บันทึกเสียง และอีกมากมาย",
        price: 48000,
        stock_quantity: 50,
        color: "#878681",
        memory: 256,
        c_name: "Smart Phone",
        image: "'https://dtaconline.dtac.co.th/pub/media/catalog/product/cache/e96373d1c57081d0b326a3dfa1f55e67/p/a/packshot-iphone-15-pro-max-black_20.png'",
        brand: "apple"
    },
    {
        product_id: 2,
        name: "iPhone 15 Pro Max",
        description: "iPhone 15 Pro Max เปลี่ยนวัสดุตัวเครื่องเป็นไทเทเนียมที่แข็งแกร่งและมีน้ำหนักเบาเกรดเดียวกับที่ใช้ในอุตสาหกรรมอวกาศ พร้อมกล้องระดับโปรที่อเนกประสงค์ยิ่งกว่าเดิม ถ่ายภาพระยะใกล้ได้คมชัดจากที่ที่ไกลกว่าเดิมด้วยกล้องเทเลโฟโต้ 5 เท่า ให้คุณได้ภาพจากระยะที่ชอบในมุมที่ใช่\nการเชื่อมต่อระดับโปร ด้วยช่องต่อ USB-C\nชิป A17 Pro GPU ระดับโปรให้เล่นเกมมือถือรู้สึกเต็มอิ่มสมจริงยิ่งขึ้น\nปุ่มแอ็คชั่นที่ปรับแต่งได้ตามต้องการทั้ง ปิดเสียง กล้อง บันทึกเสียง และอีกมากมาย",
        price: 48000,
        stock_quantity: 50,
        color: "#878681",
        memory: 256,
        c_name: "Smart Phone",
        image: "'https://dtaconline.dtac.co.th/pub/media/catalog/product/cache/e96373d1c57081d0b326a3dfa1f55e67/p/a/packshot-iphone-15-pro-max-black_20.png'",
        brand: "apple"
    },
    {
        product_id: 2,
        name: "iPhone 15 Pro Max",
        description: "iPhone 15 Pro Max เปลี่ยนวัสดุตัวเครื่องเป็นไทเทเนียมที่แข็งแกร่งและมีน้ำหนักเบาเกรดเดียวกับที่ใช้ในอุตสาหกรรมอวกาศ พร้อมกล้องระดับโปรที่อเนกประสงค์ยิ่งกว่าเดิม ถ่ายภาพระยะใกล้ได้คมชัดจากที่ที่ไกลกว่าเดิมด้วยกล้องเทเลโฟโต้ 5 เท่า ให้คุณได้ภาพจากระยะที่ชอบในมุมที่ใช่\nการเชื่อมต่อระดับโปร ด้วยช่องต่อ USB-C\nชิป A17 Pro GPU ระดับโปรให้เล่นเกมมือถือรู้สึกเต็มอิ่มสมจริงยิ่งขึ้น\nปุ่มแอ็คชั่นที่ปรับแต่งได้ตามต้องการทั้ง ปิดเสียง กล้อง บันทึกเสียง และอีกมากมาย",
        price: 48000,
        stock_quantity: 50,
        color: "#878681",
        memory: 256,
        c_name: "Smart Phone",
        image: "'https://dtaconline.dtac.co.th/pub/media/catalog/product/cache/e96373d1c57081d0b326a3dfa1f55e67/p/a/packshot-iphone-15-pro-max-black_20.png'",
        brand: "apple"
    },
    {
        product_id: 2,
        name: "iPhone 15 Pro Max",
        description: "iPhone 15 Pro Max เปลี่ยนวัสดุตัวเครื่องเป็นไทเทเนียมที่แข็งแกร่งและมีน้ำหนักเบาเกรดเดียวกับที่ใช้ในอุตสาหกรรมอวกาศ พร้อมกล้องระดับโปรที่อเนกประสงค์ยิ่งกว่าเดิม ถ่ายภาพระยะใกล้ได้คมชัดจากที่ที่ไกลกว่าเดิมด้วยกล้องเทเลโฟโต้ 5 เท่า ให้คุณได้ภาพจากระยะที่ชอบในมุมที่ใช่\nการเชื่อมต่อระดับโปร ด้วยช่องต่อ USB-C\nชิป A17 Pro GPU ระดับโปรให้เล่นเกมมือถือรู้สึกเต็มอิ่มสมจริงยิ่งขึ้น\nปุ่มแอ็คชั่นที่ปรับแต่งได้ตามต้องการทั้ง ปิดเสียง กล้อง บันทึกเสียง และอีกมากมาย",
        price: 48000,
        stock_quantity: 50,
        color: "#878681",
        memory: 256,
        c_name: "Smart Phone",
        image: "'https://dtaconline.dtac.co.th/pub/media/catalog/product/cache/e96373d1c57081d0b326a3dfa1f55e67/p/a/packshot-iphone-15-pro-max-black_20.png'",
        brand: "apple"
    },
]

